[
    {
        "id": "Fioritura",
        "name": "Fioritura",
        "type": "designLevel",
        "date": "2023",
        "descriptionProjet": "In Fioritura, an isometric puzzle game, embody a small botanist capable of <b>modifying</b> their <b>perception</b> of the environment by transplanting magical flowers into their head. You must traverse their once <b>harmonious</b> garden to contain the source of the <b>chaos</b> tormenting it. Throughout your <b>adventure</b>, discover how to <b>progress</b> through the garden without destroying it, using two magical flowers, the <b>Lumiflore</b> and the <b>Éthéralys</b>. By combining the <b>first</b>, which softens the surrounding <b>plants</b>, and the <b>second</b>, which allows you to <b>change</b> <b>worlds</b>, along with the <b>hydraulic</b> elements of the greenhouse, the player navigates through a lively and dynamic <b>environment</b> in constant evolution.",
        "txt2": [
            "Project Context and Development :",
            "During my final year of <b>Bachelor's degree in Video Game Design</b>, we were grouped into small teams of <b>four people</b> from the beginning of the semester to conceive a game concept. The idea of <b>Fioritura</b> took shape in the first week and successfully passed three evaluations despite <b>cuts</b> in projects. It even rose to be among the <b>four finalists</b> chosen to represent the university. Unfortunately, after the technical test, the project was <b>abandoned</b>. However, <b>Fioritura</b> remains a project that underwent in-depth development, going through various stages from the <b>brainstorming</b> phase, <b>pitch</b>, and <b>high-level concept</b> within the first month, to its implementation in <b>Unreal Engine</b> over a month to achieve the level of <b>technical proof</b>."
        ],
        "txt3": [
            "Implication :",
            "Since the first <b>week</b> of this project, I have been involved in a variety of <b>tasks</b>. At the <b>beginning</b>, in collaboration with the other three members of my <b>team</b>, we primarily worked on the overall <b>concept</b> of the game, focusing on the primary <b>generators</b> that interested us the most. Afterward, I dedicated a lot of <b>time</b> to the game <b>design</b> and <b>mechanics</b> to create elements that align with our primary factor, <b>psychedelia</b>, and the <b>unique</b> experience we aimed to deliver.<br><br> During the <b>high</b>-level concept <b>phase</b>, my focus shifted mainly to level <b>design</b>. I developed several paper level and <b>puzzle</b> concepts that could be integrated into the game.<br><br> At the end of the <b>ideation</b> <b>period</b>, our <b>team</b> expanded to 13 <b>members</b>, necessitating a division into <b>departments</b>. I was then appointed as the <b>lead</b> level <b>design</b> and worked intensively on blocking and improving our <b>puzzle</b> for the technical proof. In addition to level <b>design</b>, I also took charge of the majority of sound <b>design</b> with <b>Wwise</b> and half of the level <b>art</b>, while participating in the <b>programming</b> of certain <b>systems</b>."
        ],
        "images1": [
            "https://i.ibb.co/25Kzx19/start-Normal.png",
            "https://i.ibb.co/kQyN5sz/start-Lumi.png",
            "https://i.ibb.co/ZxTHfMt/start-Ethe.png",
            "https://i.ibb.co/swzmCrJ/center-Normal.png",
            "https://i.ibb.co/D5tSzYk/center-Lumi.png",
            "https://i.ibb.co/9rTY8XQ/center-Ethe.png",
            "https://i.ibb.co/h7kkJtN/end-Normal.png",
            "https://i.ibb.co/H7z3XTb/endLumi.png",
            "https://i.ibb.co/M8pNKB8/endEthe.png",
            "https://i.ibb.co/2YPVJyy/island1-Normal.png",
            "https://i.ibb.co/C8MLkTK/island1-Lumi.png",
            "https://i.ibb.co/cxdyFdW/island1-Ethe.png",
            "https://i.ibb.co/3kJvfYJ/island2-Normal.png",
            "https://i.ibb.co/X7H470c/island2-Ethe.png"
        ],
        "txtPhotos1": [
            "The player begins their adventure in a remote corner of the greenhouse with no flowers in mind. Thus, the environment becomes more <b>green and natural</b>, resembling a true garden more closely.",
            "When the player dons the <b>Lumiflor</b> in their head, the environment changes in a radius around them. The garden becomes more vibrant, with eyes on the <b>plants</b> and warmer, yellowish colors.",
            "With the <b>Etheralys</b> flower, the garden becomes quieter and seems to doze off a bit. The environment darkens, tinted with shades of blue.",
            "In the center of the greenhouse, the player can find an <b>empty pot</b> that they can push and transplant one of the <b>flowers</b> into.",
            "In the radius of <b>Lumiflor</b>, more <b>grass</b> and <b>plants</b> are visible, symbolizing the euphoric feeling that Lumiflor's aura brings to the garden.",
            "With the <b>Etheralys</b> flower, not only do the <b>plants</b> change, but also the light and particles.",
            "On the right side of the greenhouse, the player can perceive the <b>hydraulic system</b> of the garden supplying water, but blocked by <b>thorns</b>.",
            "Thanks to the aura of <b>Lumiflor</b>, the <b>thorns</b> calm down and retract, allowing the player to pass through and unlock certain mechanisms.",
            "When the player moves with the <b>Etheralys</b> flower, the <b>thorns</b> remain the same, but they can be traversed thanks to their ghostly body.",
            "A small section of the garden containing the <b>Etheralys</b> flower doesn't change the environment as long as the player doesn't take it.",
            "The aura of <b>Lumiflor</b> gradually changes the entire environment according to its aura.",
            "When the player transplants the <b>Etheralys</b> flower, they exit their physical body and become a <b>small ghost</b> that can pass through certain walls and access paths previously invisible.",
            "A small section of the garden containing the <b>Lumiflor</b> flower. Its aura affects the environment even if it's in a <b>pot on the ground</b>.",
            "With <b>Etheralys</b>, the player can see new paths unfolding in front of them, allowing access to new places. Also, the aura of <b>Lumiflor</b> is always visible, regardless of the flower the character has."
        ],
        "images2": [
            "https://i.ibb.co/fFNd6TV/Block-Pushing-Small.gif",
            "https://i.ibb.co/VBsyyNh/Etheralys-Small.gif",
            "https://i.ibb.co/KW9wJT9/Switch-Small.gif",
            "https://i.ibb.co/K5RJknd/Lumiflor-Small.gif",
            "https://i.ibb.co/0c835bJ/Vines-Small.gif",
            "https://i.ibb.co/3p00xmk/Water-Wheel-Small.gif",
            "https://i.ibb.co/ZNcsj46/Map-1.png",
            "https://i.ibb.co/rb9tLkG/Map-2.png",
            "https://i.ibb.co/t4wTqZh/Map-3.png",
            "https://i.ibb.co/MsH1m6C/map-Ingame.png"
        ],
        "txtPhotos2": [
            "One of the main mechanics in Fioritura is <b>block pushing</b>. The player can push flower pots on a roulette platform from top to bottom and from right to left. The player can also plant a flower in them and push it at the same time.",
            "The <b>transplantation</b> mechanic is the most important in our game. The player can take a flower from a pot and put it in their head. Here, they transplant the <b>Etheralys</b> and become a spectral form of themselves. This allows them to see new paths and pass through certain obstacles.",
            "In spectral form, the player can transplant the <b>Etheralys</b> with another flower and bring it back to their physical body, leaving the <b>Etheralys</b> in the pot of the other flower.",
            "With the <b>Lumiflor</b> in their head, the environment changes according to the aura around the player.",
            "The pot can be pushed with a flower inside. With the <b>Lumiflor</b>, its aura affects the environment around the pot, softening the thorns.",
            "The aura of <b>Lumiflor</b> will also soften the thorns on objects, freeing them and restarting the mechanisms.",
            "Initial and final plan for a tutorial puzzle for the <b>Lumiflor</b> flower, involving activating a lever by clearing a path previously blocked by thorns.",
            "Idea for a puzzle with a third flower not integrated into the game, providing elevation to the player, and a plan for a puzzle mixing <b>block pushing</b> with <b>Lumiflor</b>.",
            "Several iterations of the puzzle found in the current game. This includes <b>block pushing</b>, the <b>Etheralys</b> flower, and the <b>Lumiflor</b> flower.",
            "Map of the puzzle in the engine and a plan used for the technical proof."
        ],
        "cover": "https://i.ibb.co/CBc3vFc/Fioritura-Cover.png",
        "roles": [
            "Lead Level Design",
            "System designer",
            "Sound Designer"
        ],
        "technos": [
            "Unreal 5",
            "Dungeon Scrawl",
            "Wwise"
        ],
        "LienProjet": "https://team-fioritura.itch.io/fioritura",
        "LienYT": "https://www.youtube.com/embed/ZDTr5O1Idq8?si=eD_Plo_T3ys4VgOa"
    },
    {
        "id": "Raiders",
        "name": "RAIDERS",
        "type": "designLevel",
        "date": "2023",
        "descriptionProjet": "Based on the universe created by Daniel Friedman and CROM, Raiders allows you to embody <b>Marken</b>, a seasoned raider, traveling from town to town and dungeon to dungeon in search of treasures and perilous adventures! Raiders is a <b>prototype of an action-adventure RPG</b> game that skillfully blends elements of <b>dungeon crawling</b> and <b>Hack 'n' Slash</b>. In this game, players explore a medieval fantasy world filled with dungeons, monstrous creatures, and riches waiting to be unearthed. This project is divided into <b>two distinct levels</b>: the market, a tourist attraction, and the catacombs, a den of monsters and treasures. As a member of a two-person team, <b>my mission was to design the catacombs level</b>.",
        "txt2": [
            "The Market :",
            "Located at the top of a coastal highland region, this area quickly became a <b>favorite destination for Raiders</b> following the discovery of the catacombs. A thriving market has thus established itself here to attract adventurers in search of fortune. However, access to the dungeon is <b>now controlled by the royal guards</b>, forcing the daring to obtain a <b>permit</b> before entering. The challenge of this level is to obtain this permit in one of three possible ways. While exploring the market, players can also enjoy various <b>attractions</b>, participate in <b>arena battles</b>, check the <b>wanted posters</b> of criminals, or simply listen to the <b>conversations</b> of merchants. This level is full of interactions with NPCs who can assist the player in their quest and offer new opportunities for a well-deserved reward!"
        ],
        "txt3": [
            "The Catacombs :",
            "After exploring the market, players can enter the catacombs by passing through the hidden door in the massive stone sword at the tip of the peninsula. Named the Crypts of the Lover, these catacombs represent the underground passages of a fallen kingdom, brimming with <b>treasures</b>, <b>traps</b>, and now inhabited by <b>terrifying creatures</b>. The interior is immense, vast, and deep. Carved into a massive underwater cavern, <b>light is scarce</b>, obliging adventurers to equip themselves with light sources to avoid <b>unpleasant surprises</b>. Players must navigate through different levels and secret passages to discover the buried wealth. Raiders will traverse numerous rooms and face various challenges, including a <b>banquet hall</b>l, a <b>prison</b>, a <b>library</b>, a <b>crypt</b>, and much more! The dungeon is also teeming with <b>skeletal soldiers</b>, once avid adventurers revived by an unknown force and compelled to protect the riches they once coveted."
        ],
        "txt4": [
            "Inspirations and Conclusion :",
            "Our primary source of inspiration for this game was, of course, the comic <b>Raiders</b> by Daniel Friedman and CROM. We also drew elements from games such as <b>Skyrim</b>, <b>Dark Souls</b>, and even <b>Adventure Time</b> to create our gameplay mechanics and environments. My primary inspiration for the catacombs level was <b>the Mines of Moria</b> from The Lord of the Rings, as I have always been fascinated by their grandeur and oppressive atmosphere. Additionally, I drew inspiration from the layout of Bloodborne's <b>Chalice Dungeons</b> to create <b>a linear and interconnected level</b>. Raiders remains one of my favorite projects to date. I thoroughly enjoyed designing the catacombs level and crafting a detailed environment that reflects the universe of our game! Despite the countless hours invested in this prototype, I experienced complete satisfaction, confirming my passion for level design."
        ],
        "images1": [
            "https://i.ibb.co/k22BsYL/Market-2.png",
            "https://i.ibb.co/tmbjKRN/Market-1.png",
            "https://i.ibb.co/DPXQbrk/Market-3.png",
            "https://i.ibb.co/q9Jpc9b/Market-4.png",
            "https://i.ibb.co/KL7TRnj/Market-5.png",
            "https://i.ibb.co/kqxKPQP/Market-6.png",
            "https://i.ibb.co/bFPV2Qz/Market-7.png",
            "https://i.ibb.co/xSZRD31/Market-8.png",
            "https://i.ibb.co/Lv13fhg/Market-9.png",
            "https://i.ibb.co/Rc8r6fB/Market-11.png",
            "https://i.ibb.co/L9qDv4g/Market-10.png"
        ],
        "txtPhotos1": [
            "<strong>Initial player position</strong> and entrance to the market. You can see 2 <strong>royal guards</strong> to symbolize their proximity to the dungeons and a sign with <strong>wanted posters</strong>.",
            "Bridge and main path to access the market, with a view of the sea to show the location in the <strong>Highlands</strong>.",
            "Near the main entrance, the player can already start interacting with various <strong>merchants</strong> and can also catch a glimpse of the enormous sword that conceals the entrance to the dungeon.",
            "<strong>Central square of the market</strong> where all the merchants gather, with the giant hand's ring serving as a bridge to the dungeon. This symbolizes the dungeon named <strong>Crypt of the Lover</strong>.",
            "On the right side of the market, the player can find the <strong>combat arena</strong> where they can demonstrate their strength against the <strong>Highlands</strong> fighters.",
            "Right next to the arena, a crumbling ruin provides access to a <strong>small sanctuary</strong>.",
            "The <strong>sanctuary</strong> represents one of the members of the <strong>royalty</strong> of the fallen kingdom who once used this place and the dungeon.",
            "On the left coast of the market, the player can enter a <strong>building</strong> and find a small clandestine boat descent. On it, a strange <strong>character</strong> whose face appears on the <strong>wanted posters</strong> can help the player obtain a <strong>permit</strong>...",
            "Following the main path, the player arrives at the entrance of the <strong>dungeon</strong>, protected by <strong>royal guards</strong>.",
            "On the right coast, there is a boat descent used by <strong>maritime travelers</strong> to access the market.",
            "<strong>Aerial overview</strong> of the level."
        ],
        "images2": [
            "https://i.ibb.co/5KXZGMd/Highres-Screenshot00011.png",
            "https://i.ibb.co/0JgzWjL/Highres-Screenshot00012.png",
            "https://i.ibb.co/MpCBCQN/Highres-Screenshot00013.png",
            "https://i.ibb.co/RBMWjMw/Highres-Screenshot00016.png",
            "https://i.ibb.co/dQ1PmY4/Highres-Screenshot00014.png",
            "https://i.ibb.co/X79yfx7/Highres-Screenshot00015.png",
            "https://i.ibb.co/wKN3RLK/Highres-Screenshot00018.png",
            "https://i.ibb.co/QNfjXJF/Highres-Screenshot00019.png",
            "https://i.ibb.co/JsmTP4p/Highres-Screenshot00020.png",
            "https://i.ibb.co/JdTkQ9Q/Highres-Screenshot00021.png",
            "https://i.ibb.co/ng2BgCj/Highres-Screenshot00023.png",
            "https://i.ibb.co/cwz7mfk/Highres-Screenshot00024.png",
            "https://i.ibb.co/MSxGq2R/Highres-Screenshot00025.png",
            "https://i.ibb.co/MSv2X9F/Highres-Screenshot00026.png",
            "https://i.ibb.co/j3rykWQ/Highres-Screenshot00027.png",
            "https://i.ibb.co/VpMQq5h/Highres-Screenshot00028.png",
            "https://i.ibb.co/S0kbLr4/Highres-Screenshot00029.png",
            "https://i.ibb.co/cCGmkjN/Highres-Screenshot00030.png",
            "https://i.ibb.co/3z9LBhw/Highres-Screenshot00031.png",
            "https://i.ibb.co/fkKgBQW/Highres-Screenshot00033.png",
            "https://i.ibb.co/LkN8gBp/Highres-Screenshot00034.png",
            "https://i.ibb.co/WBvKKBy/Highres-Screenshot00035.png",
            "https://i.ibb.co/GT6t3Cc/Highres-Screenshot00036.png",
            "https://i.ibb.co/55MCLHH/Highres-Screenshot00037.png",
            "https://i.ibb.co/vL1TFZ0/Highres-Screenshot00039.png",
            "https://i.ibb.co/C8d7Q4D/Catacomb-Map-Engine.png"
        ],
        "txtPhotos2": [
            "<strong>Main entrance to the dungeon</strong> through the market gate. The player can already <strong>perceive</strong> that they are not the first due to the slightly open doors.",
            "As you descend the stairs, you can start to <strong>perceive several lifeless silhouettes</strong> in the room.",
            "Several <strong>skeletal remains</strong> can be found throughout the banquet hall, demonstrating a sinister past.",
            "In addition to the skeletons, the room is increasingly falling into ruin, but a <strong>silhouette</strong> can be seen on the upper floor.",
            "Just above the banquet table, the player can find a <strong>solitary feaster</strong> who holds the key to open the door leading to the rest of the dungeon.",
            "Upon leaving the room, the player will have an overview of the multiple paths and stairs in the dungeon, as well as the grandeur and depth of the place.",
            "Taking the first path, the player can <strong>spot another bridge</strong> and 3 accessible rooms from slightly below.",
            "Upon reaching the first room, the player can see a <strong>roaming skeletal guard</strong> inside and a completely broken facade.",
            "The presence of <strong>guards, cells, and torture tools</strong> indicates that this room served as a prison. A good place to find confiscated items.",
            "Inside the cells, the player may <strong>perceive the remains of less fortunate adventurers</strong>...",
            "Upon leaving the prison, the player will encounter <strong>other guards</strong> and notice 2 staircases along the path, one going up and the other going down.",
            "By taking the descending staircase, the player must be agile and jump over the gap that separates the bridge and the room.",
            "Once the agility test is successfully passed, the adventurer will find themselves inside a <strong>small library</strong>.",
            "Lying partly on the table, the remains of a scribe protect a document indicating the presence of an <strong>alleged hidden treasure</strong> in the room.",
            "The adventurer's path continues through the staircase leading to <strong>one of the pillars</strong>, on which you can see 3 other paths.",
            "The first path leads to a very <strong>small room</strong> that should not be judged by its size.",
            "As soon as the player enters the room, they realize they have just found one of the <strong>treasure-filled rooms with gold and jewels to take</strong>!",
            "Back at the pillar, <strong>2 more paths await the player</strong>.",
            "By taking the left path, the player comes across <strong>a reception room flooded with poisoned water</strong>, but can spot a path made of wooden planks leading to the balconies.",
            "On the left balcony, you can find <strong>a small armory guarded by a skeletal soldier</strong>, but also filled with new equipment!",
            "On the right balcony, <strong>a tunnel opens up in front of the adventurer</strong>, perhaps the solution to the poison lies at the end.",
            "Exiting the tunnel, the player emerges in <strong>a new room that appears to be a crypt for members of the royal family</strong>.",
            "The room is indeed filled with plunderable sarcophagi, but also with <strong>guards and a strange object at the end of the room</strong>.",
            "The player, upon opening the tombs, can find gold and jewels and also <strong>perceive certain symbols</strong> that could be related to the strange object.",
            "Finally, once the player successfully lowers the water by solving the puzzle, they can <strong>enter the last room</strong> of the dungeon and face the boss, <strong>Patches</strong>, a familiar face that appeared everywhere on the <strong>wanted posters</strong> in the market!",
            "<strong>Aerial overview</strong> of the dungeon level."
        ],
        "titreCanva": "L0 & Maps of the levels :",
        "canva": [
            "https://drive.google.com/file/d/1mYj5p3M63gl1pRZ1WVIdxdlxh4DXSU8v/preview",
            "https://miro.com/app/live-embed/uXjVPkU8D0c=/?moveToViewport=-1769,-1197,14703,4259&embedId=262128617332"
        ],
        "cover": "https://i.ibb.co/dfn9CQm/Raiders-Cover.png",
        "roles": [
            "Level designer"
        ],
        "technos": [
            "Unreal 5",
            "Miro"
        ],
        "LienYT": "https://www.youtube.com/embed/rgxy_hOkzjg?si=N9QFrtKTcgJCSxIe",
        "collab": [
            "Justin Marques"
        ],
        "collabLiens": [
            "https://justinmarques.myportfolio.com/"
        ],
        "LienProjet": "https://mathieugaudreau.itch.io/raiders"
    },
    {
        "id": "MovingSlaugh",
        "name": "The Moving Slaugh",
        "type": "designLevel",
        "date": "2023",
        "descriptionProjet": "<b>The Moving Slough</b> is a two-part project that distinguishes itself by its content while remaining closely interconnected. The first part of the project involves <b>creating a semi-realistic universe</b> set in 19th century Louisiana. In this world, a <b>profound darkness reigns, populated by morbid creatures</b> of all kinds. No one knows exactly why, but the epicenter of this darkness appears to emanate from a region erased from the maps: <b>the Moving Slough</b>, an extremely perilous territory that only the most daring hunters dare to explore. The second part of the project focuses on <b>creating a game level</b> that allows players to explore this swamp and uncover clues and <b>traces of a bloody event</b>.",
        "txt2": [
            "Production :",
            "The project spanned a period of <b>10 weeks</b>, with 4 weeks dedicated to creating the universe and 6 weeks to designing the level itself. For the creation of the universe, I deliberately chose to <b>focus on a small part</b> of a potentially much larger world, teeming with unexplored ideas. This choice stems from my desire to <b>create something specific, highlighting a unique location</b>. This approach facilitated its representation as an exploratory level, where players can gather clues about the mysterious events that took place in this universe. For the level's design, I began the process by drawing a detailed map to ensure that <b>all paths could be connected</b>, with almost all <b>leading to the center</b> of the swamp. In the editor, the most crucial aspect of production was ensuring that the player was skillfully guided to the heart of the swamp, where most of the key elements are concentrated."
        ],
        "txt3": [
            "Challenges Faced :",
            "This project presented several challenges, both in creating the universe and in designing the game level. The main challenge in creating the universe was to <b>remain concise</b> and stay within the boundaries I had set for myself, focusing mainly on the details of the marshy region. The primary challenges related to level design were associated with the use of Unreal Engine's <b>terrain tool</b> and ensuring that <b>all paths were accessible and navigable</b>. With limited experience with this tool, I had to go through numerous trial-and-error attempts to achieve the result I am proud of today. I also had to conduct numerous tests and research to <b>create a dark and oppressive atmosphere</b> while ensuring smooth navigation."
        ],
        "txt4": [
            "Inspirations :",
            "I drew a lot of inspiration from role-playing games such as <b>We Deal in Lead, Deadlands, and Into the Wyrd and Wild</b> for the creation of my universe, drawing from their types of creatures, locations, and themes. I also gathered many concepts and ideas from books like <b>The Planet Construction Kit</b> by Rosenfelder and <b>Kobold Guide to Worldbuilding</b> by Grubb. As for the level design, I drew extensive inspiration from swamp levels in games like <b>The Witcher, Hunt: Showdown, and Weird West</b>. My love for the western theme has always been a source of inspiration for me, and I am delighted to have had the opportunity to explore this genre and create my own altered universe."
        ],
        "images1": [
            "https://i.ibb.co/T8WGP2X/Swamp-2.png",
            "https://i.ibb.co/g6Rpr5y/Swamp-3.png",
            "https://i.ibb.co/X5qFM8m/Swamp-4.png",
            "https://i.ibb.co/T1YNYr3/Swamp-5.png",
            "https://i.ibb.co/ctB47G4/Swamp-6.png",
            "https://i.ibb.co/BZ8rkPT/Swamp-7.png",
            "https://i.ibb.co/RD9f441/Swamp-8.png",
            "https://i.ibb.co/bzDDfGn/Swamp-14.png",
            "https://i.ibb.co/phgW0Th/Swamp-15.png",
            "https://i.ibb.co/LPj0pPx/Swamp-9.png",
            "https://i.ibb.co/wdLcx0f/Swamp-10.png",
            "https://i.ibb.co/vLdYszq/Swamp-11.png",
            "https://i.ibb.co/fkgXZWC/Swamp-13.png",
            "https://i.ibb.co/rpw9BfV/Swamp-16.png",
            "https://i.ibb.co/m6cb4tw/Swamp-17.png",
            "https://i.ibb.co/2F5X4hw/Swamp-18.png",
            "https://i.ibb.co/HHLhr06/Swamp-Map-2.png",
            "https://i.ibb.co/Qm7VFKx/Swamp-Map-1.png"
        ],
        "txtPhotos1": [
            "The player begins their exploration of the level in a section of the swamp that is both <b>dark</b> and <b>damp</b>. From the very first steps, they immediately spot a glimmer ahead of them.",
            "As they advance, the player discovers the <b>hunters' camp</b>, with some items overturned and broken, suggesting that its occupants must have fled in <b>haste</b>. The scattered torches encourage the player to continue in that direction.",
            "While continuing their journey, the player comes across a partially devoured <b>horse</b>, a sign that a deadly threat lurks nearby.",
            "Upon reaching the <b>bridge</b>, the player glimpses the <b>cabin</b> at the heart of the swamp, as well as other sources of light indicating areas of interest to explore.",
            "As they approach the <b>cabin</b>, one of these sources of light becomes clearer, revealing a silhouette standing near a tree.",
            "A thorough inspection of the <b>house</b>, seen from the front, reveals no signs of life, but the second source of light now becomes visible.",
            "As soon as the player enters the <b>cabin</b>, they discover the corpse of one of the <b>hunters</b> lying before them.",
            "Through one of the <b>windows</b>, the player can see one of the sources of light and discern a silhouette sprawled on the ground.",
            "Upon exiting the <b>cabin</b>, the first source of light beckons the player.",
            "Once on the scene, the player discovers the corpse of the second <b>hunter</b>, alongside their weapon, indicating that they fought to the end.",
            "The other <b>bridge</b>, accessible from the <b>cabin</b>, guides the player to the second source of light.",
            "After crossing this <b>bridge</b>, the player discovers the corpse of the third <b>hunter</b>, also dead next to their weapon.",
            "In this swamp, where the lighting is low and thick fog obscures the view, the player cannot discern whether danger awaits them further...",
            "The <b>cabin</b>, seen from a different angle, demonstrates that the sources of light remain visible despite the fog, serving as beacons to guide the player.",
            "When the player approaches the <b>cabin</b> from one of the <b>bridges</b>, here is their point of view.",
            "Here is the perspective along one of the <b>dark</b> and <b>eerie</b> paths.",
            "This is a preliminary sketch of the swamp map.",
            "An aerial view of the final product for the level."
        ],
        "cover": "https://i.ibb.co/87C1jPP/Moving-Slaugh-Cover.png",
        "roles": [
            "Level designer",
            "Narrative designer"
        ],
        "canva": [
            "https://e.notionhero.io/e1/p/a5a9c27-e8bbe1a3cf425d926b280a8ffe4f721"
        ],
        "technos": [
            "Unreal 5",
            "Notion"
        ],
        "LienYT": "https://www.youtube.com/embed/Nf75COoVJaQ?si=ALDsi5Mg3Ztku7oW",
        "LienProjet": "https://mathieugaudreau.itch.io/the-moving-slough"
    },
    {
        "id": "SpaceScoundrel",
        "name": "Space Scoundrel",
        "type": "designJeu",
        "date": "2022",
        "descriptionProjet": "<b>Space Scoundrel</b> is a <b>third-person shooter</b> game with an <b>Action Roguelike</b> style that puts players in the shoes of a <b>treasure-seeking space pirate</b>. The main goal of the player is to <b>board enemy ships</b> and plunder them for their precious loot. Players will explore <b>procedurally generated ships</b> where they will face a variety of enemies and have access to various weapons for defense.",
        "txt2": [
            "Gameplay:",
            "The player's mission is to make their way through the ship, <b>fighting to survive</b> until they reach the <b>control room</b>. Once there, they take control of the ship, marking the end of the game. If the player loses their life along the way, they will have to <b>start from scratch</b> in a brand new procedurally generated ship."
        ],
        "txt3": [
            "Production and Involvement:",
            "This project was developed by a team of <b>2 people</b> and spanned a period of <b>6 weeks.</b> My main responsibilities in this project were <b>designing the game systems</b> and <b>programming</b> the dungeon generation system, weapons, character, and enemies. I implemented a <b>dungeon generation system</b> capable of taking prefab parts and creating a layout on a grid based on the desired size. I also developed a <b>weapons system</b> with various statistics, providing the player with a varied gaming experience depending on the weapon they choose to use."
        ],
        "txt4": [
            "Challenges:",
            "The major challenge of this project lay in <b>setting up the enemy system</b>, as I had little experience with state machines. So, I had to conduct in-depth research to understand how they work. This part of the project was the most time-consuming, but I am <b>satisfied with the result</b> achieved for a first experience. I am particularly proud of the project, which represents my most <b>ambitious achievement to date</b>."
        ],
        "LienBuild": "https://itch.io/embed-upload/7151988?color=7da2a9",
        "images1": [
            "https://i.ibb.co/D9GMyrs/SS-Spawn.png",
            "https://i.ibb.co/1bWwn5j/SS-Caf.png",
            "https://i.ibb.co/GHSb8VR/SS-Storage.png",
            "https://i.ibb.co/1ffRHb5/SS-Plants.png",
            "https://i.ibb.co/NKVFsF4/SS-Offices.png",
            "https://i.ibb.co/nmmwXjh/SS-Meeting-Room.png",
            "https://i.ibb.co/ZcN74tr/SS-Lab.png",
            "https://i.ibb.co/wds3jKN/SS-Generator.png",
            "https://i.ibb.co/4ST29JG/SS-Ennemy.png",
            "https://i.ibb.co/HxKFV5h/SS-Menu.png",
            "https://i.ibb.co/jbKQMBH/SS-Controls.png",
            "https://i.ibb.co/T2P9RJb/SS-Gun-Desc.png",
            "https://i.ibb.co/dkLY7dR/SS-Gun-Comp.png",
            "https://i.ibb.co/pZnZ7Yy/SS-Floating-UI.png",
            "https://i.ibb.co/J7HzNkZ/SS-Final-Room.png"
        ],
        "txtPhotos1": [
            "<b>Game start room</b>: The player always begins their journey in the <b>ship's engine room</b>. Here, they can see the <b>help panels</b> that indicate the <b>game controls</b>. Additionally, they can obtain their <b>starting weapon</b>, visible thanks to its <b>luminous outline</b>.",
            "One of the rooms that can be found in the <b>spaceship</b> is the <b>cafeteria</b>. Although it is quite spacious, it provides little <b>cover</b> for the player. However, they can discover <b>new weapons</b> here.",
            "Another possible room is the <b>storage room</b>. It is rather narrow, but the <b>shelves</b> make it easier to protect oneself from <b>enemy fire</b>. In this room, the player can find a <b>new weapon</b> and <b>healing items</b>.",
            "The <b>greenhouse</b> can also be a part of the <b>spaceship</b>. Inside, the player has several <b>cover options</b> and can even <b>move to an upper level</b>.",
            "The <b>office rooms</b> are another possibility. They are rather narrow due to the multiple <b>workstations</b>, but the player can easily <b>take cover</b> and find <b>new weapons</b>.",
            "The <b>meeting rooms</b> are dangerous spaces that offer little <b>cover</b> and even <b>give enemies the advantage of height</b> due to <b>two elevated platforms</b>.",
            "The <b>laboratory</b> is a rather dark room, making it difficult to see the positions of enemies. In this room, the player can <b>heal themselves with a health pack</b>.",
            "When the player is in the <b>generator room</b>, they must be careful not to <b>fall into the void</b>. This makes combat a bit more dangerous because they need to watch where they step while fighting enemies.",
            "Different types of <b>enemies</b> are found in the <b>spaceships</b>. The player can battle <b>humans, robots, or lizard-like aliens</b>!",
            "<b>Main menu of the game</b>: The player sees their <b>character on the ship</b>, ready to <b>board another vessel</b>. Menu elements <b>float</b> in the <b>environment</b>.",
            "The main menu also includes a section to learn the <b>controls</b> and adjust various options such as <b>sound and mouse sensitivity</b>.",
            "In the game, when the player presses the <b>inspection key</b>, they can view information about the <b>weapon they are holding</b>, such as <b>rate of fire, damage, and available ammunition</b>. The <b>camera changes to over-the-shoulder view</b>, and the <b>menu appears in front of the character</b>. We drew a lot of inspiration from the <b>UI of Dead Space</b> for our game.",
            "When the player comes across a <b>new weapon</b>, a <b>menu appears above the weapon</b> to show the <b>differences between the two</b>.",
            "As the player approaches a <b>new weapon</b>, the <b>statistics of the weapon</b> appear above it to help the player decide what to use.",
            "When the player reaches the <b>final room</b> and is ready to finish their adventure, a <b>floating menu appears in front of them</b>."
        ],
        "images2": [
            "https://i.ibb.co/HVL09wr/Vaisseau-1.png",
            "https://i.ibb.co/5hPcZd0/Vaisseau-2.png",
            "https://i.ibb.co/WV0XJ3c/Vaisseau-3.png",
            "https://i.ibb.co/G0dvVgP/SS-Spawn-Layout.png",
            "https://i.ibb.co/wNJhj7C/SS-Caf-Layout.png",
            "https://i.ibb.co/Gv00MFc/SS-Gen-Layout.png",
            "https://i.ibb.co/wd8zLVz/SS-Lab-Layout.png",
            "https://i.ibb.co/Yj1PcJ9/SS-Meeting-Layout.png",
            "https://i.ibb.co/nMd8Rxx/SS-Office-Layout.png",
            "https://i.ibb.co/mRNdNKX/SS-Stock-Room-Layout.png",
            "https://i.ibb.co/WtpB4Yv/SS-Serre-Layout.png",
            "https://i.ibb.co/Bsyhm7S/SS-Command-Layout.png"
        ],
        "txtPhotos2": [
            "<b>Possible example of spaceship generation</b>: The generator is based on a 5 x 5 grid and can generate dungeons that are both very long and very short. Additionally, I have created several options and parameters, such as a minimum and maximum number of rooms, to avoid making the game too long.",
            "The player always starts in the same place, the room located in the lower-left corner. The system then creates a path and generates the different rooms.",
            "The player also always ends up in the same room, the <b>ship's control room</b>. In the various generation parameters, I added an option to make certain rooms mandatory or not, as well as the maximum number of times they can appear in the ship.",
            "All rooms have <b>4 possible doors</b> and must be square to work in the system. This means that paths can go in any direction.",
            "<b>Cafeteria layout</b>.",
            "<b>Generator room layout</b>.",
            "<b>Laboratory layout</b>.",
            "<b>Meeting room layout</b>.",
            "<b>Office room layout</b>.",
            "<b>Storage room layout</b>.",
            "<b>Greenhouse layout</b>.",
            "<b>Control room layout</b>."
        ],
        "cover": "https://i.ibb.co/9sFqxLr/space-Scoundrel-Cover.png",
        "roles": [
            "Designer",
            "System designer",
            "Programmer"
        ],
        "LienProjet": "https://mathieugaudreau.itch.io/space-scoundrel",
        "technos": [
            "Unity",
            "C#"
        ],
        "collab": [
            "Justin Marques"
        ],
        "collabLiens": [
            "https://justinmarques.myportfolio.com/"
        ]
    },
    {
        "id": "PetitHeros",
        "name": "Petit Héros",
        "type": "designLevel",
        "date": "2021",
        "descriptionProjet": "<b>Petit Héros</b> is an <b>action-adventure</b> game heavily influenced by the <b>EarthBound</b> game series, both in its graphical style and narrative approach. In this game, players assume the role of a young hero who must <b>save the world</b> from the Dame en Noire, a demonic entity intent on taking over the Earth. This child also possesses the <b>power to travel to a fantastical world</b> to accomplish their quest, leading to a transformation of all elements in the real world.",
        "txt2": [
            "Production and Involvement:",
            "This project was developed in collaboration with a team of <b>6 people</b>, spanning approximately <b>6 weeks</b>. My primary responsibilities included <b>creating all the tiles</b> used to build the levels, <b>designing enemies</b> and their animations, as well as creating various <b>decorative elements</b>. I also took on the role of a <b>level designer</b>, which involved creating and integrating engaging levels in both the real and imaginary worlds."
        ],
        "txt3": [
            "Challenges and Difficulties:",
            "The major challenge I faced in this project was <b>level design</b>. The imaginary world inherently appeared more attractive and intriguing to explore than the real world. Therefore, it was <b>essential to make both worlds equally exciting</b> by cleverly placing different interactions, non-player characters (NPCs), and objects in the levels to encourage players to explore both realms."
        ],
        "txt4": [
            "Inspiration:",
            "Our game was created in collaboration with Quebecois comedian <b>Tommy Gaudet</b>, a lover of the absurd, whimsical, and fantastical. We drew extensive inspiration from his <b>quirky universe</b> and sought to integrate his love for larping by creating an imaginary adventure that unfolds in the mind of the main character. Additionally, we drew inspiration from his favorite <b>retro games</b>, both in terms of aesthetics and gameplay, drawing from titles such as the <b>EarthBound</b> series and <b>The Legend of Zelda</b>."
        ],
        "LienYT": "https://www.youtube.com/embed/4GJr4MK-xMg",
        "images1": [
            "https://i.ibb.co/2tz59B4/Blocking-Monde-1-2.png",
            "https://i.ibb.co/Q8Bdjny/Blocking-Monde-1-1.png",
            "https://i.ibb.co/1qhqGPj/Blocking-Monde-2-1.png",
            "https://i.ibb.co/mThGYkb/Blocking-Monde-2-2.png",
            "https://i.ibb.co/9TTHCDK/Blocking-Monde-3-1.png",
            "https://i.ibb.co/GJhpSTv/Blocking-Monde-3-2.png"
        ],
        "txtPhotos1": [
            "In the first level, the little hero begins his adventure in front of his mother's house, who advises him to be careful during his journey. He can then explore the small town composed of five streets. The objective of this level is to talk to various characters to find a way to move the car that is blocking the town's exit and thus continue his adventure. The player will be able to interact with several people, such as a <b>grandmother</b>, a <b>conspiracy theorist</b>, a <b>homeless person</b>, and <b>residents</b>.",
            "In the imaginary world, everything changes radically, but the layout remains the same. For example, houses transform into <b>mushrooms</b>, the <b>mother</b> becomes a <b>queen</b>, animals can now talk, and some characters transform into <b>magicians</b>. Moreover, the world is now invaded by <b>slimes</b>, the game's main enemies that the hero can defeat with his <b>sword</b>. The color palette changes dramatically to create a real distinction between the two worlds.",
            "The continuation of the adventure takes place in a park. In this level, the player must find a way to move the man with the <b>newspaper</b> blocking the bridge. By exploring the level, he can discover a water source and thus wet the man's <b>newspaper</b>, allowing him to pass later.",
            "In this level, the majority of the puzzle is in the imaginary world. Indeed, one of the trees comes to life and gives the player a <b>vine</b> that will allow him to retrieve the bucket from the bottom of the well, which was previously a water fountain. The man with the <b>newspaper</b> also transforms into a <b>black knight</b> who will attack the player if he gets too close.",
            "Finally, the last level of the game takes place on a golf course in the middle of a game for the present golfers. In this level, the player must find a way to unlock the door leading to the forest while watching out for the <b>snakes</b> that are roaming. Additionally, the player must find the keys to one of the golfer's carts in exchange for his <b>radio</b>, which will allow him to face the <b>final boss</b>.",
            "In the imaginary world, the hero can talk to a <b>goose</b>, who entrusts him with the mission of finding her eggs in exchange for the golfer's keys, who has become a <b>pot-man</b>. After finding the eggs, which turn out to be golf balls, he can give them to the golfer and retrieve the <b>radio</b>. Then, by placing it near the hole, a huge <b>black snake</b> will emerge, and the little hero can thus face the <b>final boss</b> of the game!"
        ],
        "images2": [
            "https://i.ibb.co/kgrsFFY/Main-tuiles.png",
            "https://i.ibb.co/0DFMRNN/Golf-Tuiles.png",
            "https://i.ibb.co/znsL8nC/Fences-Tuiles.png",
            "https://i.ibb.co/ZTzxLwS/Maint-Tuiles-2.png",
            "https://i.ibb.co/1vmC5cy/Pont-Tuiles.png",
            "https://i.ibb.co/P9nMSGb/Maisons.png",
            "https://i.ibb.co/sbSTP9P/Decor-1.png",
            "https://i.ibb.co/8BpNz0F/Voiture.png",
            "https://i.ibb.co/5kK15rJ/Tables.png",
            "https://i.ibb.co/Tmq3LHD/Puit.png",
            "https://i.ibb.co/M73TkqB/Cart.png",
            "https://i.ibb.co/G03z8Y6/Arbres.png",
            "https://i.ibb.co/tZm4kyp/Arbres-img.png",
            "https://i.ibb.co/6HwL0Rp/Decor-2.png",
            "https://i.ibb.co/FnkLYP6/Enemy.gif",
            "https://i.ibb.co/bsN0Qzr/Animaux.gif",
            "https://i.ibb.co/h7hxbDb/NPC.gif",
            "https://i.ibb.co/bQt6D7s/Vieil-Arbre.gif"
        ],
        "txtPhotos2": [
            "Tiles for Levels <b>1</b> and <b>2</b>: These two levels are primarily composed of <b>grass</b>, <b>water</b>, and small <b>sand</b> areas. All the tiles are designed to fit together seamlessly and always provide a smooth transition between different materials.",
            "Tiles for Level <b>3</b>: As it is a golf course, this level also uses standard <b>grass</b> tiles but needed a different color to represent the <b>green</b> of the course.",
            "<b>Fence</b> tiles are used in all levels to easily delineate areas.",
            "<b>Paving</b> tiles are used in all levels, especially in the first one for <b>sidewalks</b>.",
            "<b>Bridge</b> tiles are used in all levels and transform into <b>water lilies</b> in the imaginary world.",
            "Three variations of <b>houses</b> for the first level, heavily inspired by the houses in the game Earthbound.",
            "Various <b>decorative elements</b> and their counterparts in the imaginary world. When the world changes, objects remain in place but become more fantastic.",
            "The <b>car</b> blocking the passage in Level <b>1</b> transforms into a <b>cart</b> in the imaginary world.",
            "The <b>tables</b> and <b>park benches</b> in Level <b>2</b> become <b>stone tables</b> and <b>stone benches</b>.",
            "One of the items necessary to complete the <b>quest</b> in Level <b>2</b>, the <b>water fountain</b>, becomes a <b>well</b>. This allows the player to obtain the <b>bucket</b>.",
            "The <b>golf cart</b> in Level <b>3</b> transforms into a <b>traveling merchant's caravan</b> in the imaginary world.",
            "The <b>trees</b> in the real world retain their <b>natural color</b> and all have a <b>black outline</b>, unlike their imaginary counterparts.",
            "The <b>imaginary world's trees</b> completely change their <b>color palette</b> and also have <b>strange shapes</b>.",
            "The small <b>decorative plants</b> in the real world transform into highly <b>colorful plants</b> resembling <b>magic mushrooms</b> in the imaginary world.",
            "The different <b>enemies</b> in the game: <b>slimes</b> are only found in the imaginary world, while <b>snakes</b> can be encountered in the real world and also have an imaginary version.",
            "The <b>animals</b> present in the various levels also have an imaginary version and can now <b>speak</b>.",
            "The two <b>cats</b> found in the levels become <b>characters</b> in the imaginary world, with whom the player can have brief <b>conversations</b>.",
            "The huge <b>tree</b> in Level <b>2</b> transforms into a <b>magic tree</b> in the imaginary world and gives one of its <b>vines</b> to the player, allowing them to retrieve the <b>bucket</b> from the bottom of the well."
        ],
        "cover": "https://i.ibb.co/xfLVbzL/CoverPH.png",
        "roles": [
            "Level designer",
            "Illustrator"
        ],
        "technos": [
            "Aseprite",
            "Unity"
        ],
        "LienProjet": "https://axistedaxe.itch.io/petit-heros",
        "collab": [
            "Jérémy Bolduc",
            "Christian Forget",
            "Justin Marques"
        ],
        "collabLiens": [
            "https://boldje1work.wixsite.com/portfolio",
            "https://christianforgetmultimedia.com/",
            "https://justinmarques.myportfolio.com/"
        ]
    },
    {
        "id": "LastSpark",
        "name": "Last Spark",
        "type": "designJeu",
        "date": "2020",
        "descriptionProjet": "<b>Last Spark</b> is an <b>action, adventure, and survival</b> game set in a <b>sinister and oppressive atmosphere</b>. The player takes on the role of the world's last hope, tasked with <b>surviving long enough to overcome the lords of darkness</b> and their sinister minions who roam freely in the environment. The solitary traveler must explore this devastated world in search of weapons and spells to support them in their desperate quest.",
        "txt2": [
            "Production and Contribution :",
            "This project was conceived and developed by a team of <b>three people</b> over a period of <b>four months</b>. My main responsibilities included <b>game design</b>, <b>setting up systems</b>, and <b>programming</b>, especially for the <b>day/night cycle</b> and the <b>inventory and crafting system</b>. My tasks encompassed <b>creating gameplay mechanics</b> and the game world, <b>balancing</b> and managing enemy waves that only appeared at night to ensure the player wasn't quickly overwhelmed, as well as integration into Unity. The majority of my work involved programming and managing the entire inventory and crafting system, including all the items the player could collect and use."
        ],
        "txt3": [
            "Challenges and Difficulties :",
            "The most significant challenge in this project was properly <b>balancing the damage of each weapon</b> to prevent them from becoming either useless or too powerful. It was also necessary to <b>find the right combinations for crafting</b> recipes so that they were neither impossible to achieve nor too easy. Managing the drop rate and rarity of ingredients was also a major concern."
        ],
        "txt4": [
            "Conclusion:",
            "The final project was <b>warmly received</b> by our professors and peers, and it continues to be cited as an example in the course for current students. I feel <b>immense pride</b> in this project because it represents my first significant achievement, and it embodies a concept we had in mind since the beginning of our studies. Seeing it finally come to life held a special significance for me."
        ],
        "LienBuild": "https://itch.io/embed-upload/7163183?color=7da2a9",
        "LienProjet": "https://lastspark.netlify.app/",
        "LienYT": "https://www.youtube.com/embed/5FMPfM0h2wI",
        "canva": [
            "https://drive.google.com/file/d/1oq-eduBk8chdUY3K3PrFkLPofq6eKeCx/preview",
            "https://drive.google.com/file/d/1ahRtIMVLA-P4gkrcs1im5HEyR3BY8XC8/preview"
        ],
        "GH": "https://github.com/MathieuGaudreau/LastSpark",
        "images1": [
            "https://i.ibb.co/yPykPpD/debut.webp",
            "https://i.ibb.co/qntnzG9/ruine.webp",
            "https://i.ibb.co/7nZ1vS5/boss.webp",
            "https://i.ibb.co/D1HMDV5/Exemple-Map-Last-Spark.png",
            "https://i.ibb.co/353y9MF/inventaire.webp"
        ],
        "txtPhotos1": [
            "The player begins their adventure near their <strong>campfire</strong>, the only source of light in this world where they will find their <strong>starting weapon</strong>. This weapon allows them to burn the souls of the <strong>lords</strong> after defeating them. The fire also enables them to <strong>craft new weapons</strong> and protect themselves from monsters during the dark nights.",
            "During their exploration, the player may come across small <strong>sanctuaries</strong> where they can find <strong>new weapons</strong> or <strong>spells</strong>.",
            "The <strong>lords of darkness</strong> are large creatures made of shadow who battle with enormous swords. They can be identified by the <strong>circle of skulls</strong> that surrounds them. Once defeated, the player can collect <strong>their soul</strong>, and if lucky, their sword.",
            "An example of the extent of the game's map. Being <strong>randomly generated</strong>, the <strong>lords</strong> and <strong>sanctuaries</strong> can be found anywhere. Additionally, each time the player burns a soul, <strong>the map regenerates</strong>.",
            "Inventory menu that also allows you to <strong>craft new weapons</strong>. Each item fits into a slot, and the player can hover their mouse over it to get more details."
        ],
        "images2": [
            "https://i.ibb.co/SxDkn31/LS-Enemy.png",
            "https://i.ibb.co/Y3ts91v/LS-Mini-Boss.png",
            "https://i.ibb.co/k1W0t3Q/LS-Fleur.png",
            "https://i.ibb.co/Wvzrq9q/LS-Boss.png",
            "https://i.ibb.co/rk2zrp3/LS-Boss-Attack.png"
        ],
        "txtPhotos2": [
            "The <strong>generic enemies</strong> in the game are round shapes with enormous mouths. They are always present in the game, especially in larger numbers at night, but they cannot approach the campfire or engage in battles against the <strong>lords</strong>. They attack in close combat and gather in groups to pursue the player.",
            "The <strong>lords of darkness</strong> are the first bosses that the player must defeat to progress in the game. Once defeated, they give their <strong>soul</strong>, which allows the map to regenerate and find the next one. After collecting 3 <strong>souls</strong>, the grand boss arrives.",
            "When the player has burned the 3rd <strong>soul</strong>, the next boss will be the last one. While exploring, the <strong>adventurer</strong> will come across a small flower with <strong>sharp teeth</strong>. When they approach it a bit, the <strong>final boss</strong> emerges from the ground for the battle.",
            "The <strong>boss</strong> closely resembles the <strong>generic enemies</strong> to indicate that this entity is the source of corruption. With its large mouth, it <strong>bites</strong> the player and moves around floating.",
            "In addition to <strong>biting</strong>, it can extend <strong>its arms</strong> and strike the ground, summoning <strong>tentacles</strong> at the player's position to deal damage."
        ],
        "cover": "https://i.ibb.co/yP4mz3P/lastspark-Cover.png",
        "roles": [
            "Project manager",
            "Sound Designer",
            "Programmer",
            "Integrator",
            "Designer"
        ],
        "technos": [
            "Unity",
            "C#",
            "Photoshop",
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "collab": [
            "Justin Marques",
            "Jean-Philippe Filiatrault"
        ],
        "collabLiens": [
            "https://justinmarques.myportfolio.com/",
            "https://www.behance.net/jean-phfiliatr"
        ]
    },
    {
        "id": "NightwellKeep",
        "name": "Escape the Nightwell Keep",
        "type": "designLevel",
        "date": "2021",
        "descriptionProjet": "<b>Escape the Nightwell Keep</b> is a captivating <b>adventure</b> and <b>platform</b> game prototype featuring a determined prisoner trying to <b>escape</b> from a haunted castle infested with <b>skeletons</b> and <b>deadly traps</b>. The player will need to find their way through this dark castle while collecting precious treasures on the way to the safe exit.",
        "txt2": [
            "Production and Involvement:",
            "I developed this prototype <b>solo</b> over a period of 3 weeks. My responsibilities included <b>level design</b>, <b>programming</b> game mechanics and enemies, as well as <b>integrating</b> them into the Unity development environment."
        ],
        "txt3": [
            "Challenges:",
            "The most challenging aspect of this production was <b>creating the level</b> and <b>programming</b> the enemies. This project marked my first real experience with level design, and I wanted to create a map of a <b>scale similar</b> to what you find in <b>Dead Cells</b>. I took on a lot of responsibilities and had to start over several times to achieve a result that satisfied me while avoiding the level becoming too long and repetitive."
        ],
        "txt4": [
            "Inspiration:",
            "My main sources of inspiration were primarily <b>Dead Cells</b> and <b>Blasphemous</b>, both in terms of level design, gameplay, and aesthetics. These games and their universes have been among my favorites for a long time, and I have always dreamed of creating my own interpretation, even though it presented a significant challenge for me!"
        ],
        "LienProjet": "https://mathieugaudreau.itch.io/escape-the-nightwell-keep",
        "images1": [
            "https://i.ibb.co/GFqmzRw/Blocking-Donjon.png",
            "https://i.ibb.co/BwnvGPm/Start.png",
            "https://i.ibb.co/DDHfrKk/Area1.png",
            "https://i.ibb.co/pZwCVGn/Area2.png",
            "https://i.ibb.co/7nRFt18/Area3.png",
            "https://i.ibb.co/VBSwrqT/Area4.png",
            "https://i.ibb.co/5rZbnBq/Secret-Area.png"
        ],
        "txtPhotos1": [
            "<strong>Level map</strong> in Unity's editor. It is greatly inspired by the potential dungeon of Dead Cells and features multiple explorable sections, but <strong>only one exit.</strong>",
            "Starting location for the player, they begin next to one of the statues that serve as a <strong>checkpoint</strong> when the player interacts with them.",
            "During their exploration, the player will encounter different types of enemies, such as <strong>skeletons</strong>. They move from right to left and can strike the player with their sword.",
            "The game is also a platformer and will encourage the player to jump from <strong>platform</strong> to <strong>platform</strong> to reach certain places.",
            "Several traps are scattered in the environment and will inflict damage on the character if touched. Additionally, another type of enemy is represented by the <strong>archers</strong> who shoot arrows towards the player.",
            "The player can also find <strong>treasure chests</strong> throughout the level. They contain gemstones and are visible thanks to their glow.",
            "Some paths lead to <strong>dead ends</strong> in the dungeon, prompting the player to try another route. This is intended to create a <strong>maze-like effect</strong> in the game."
        ],
        "cover": "https://i.ibb.co/ypck3S5/nightwell.png",
        "roles": [
            "Level designer",
            "System designer",
            "Programmer",
            "Integrator",
            "Sound designer"
        ],
        "technos": [
            "Unity",
            "C#"
        ]
    },
    {
        "id": "RegneMalheurs",
        "name": "Règne de Malheurs",
        "type": "designJeu",
        "date": "2021",
        "descriptionProjet": "<b>Règne de Malheurs</b> is a unique <b>territory control</b> game where players each embody a <b>primary emotion</b> that influences the actions of a medieval baron. The ultimate goal of the players is to become <b>the dominant emotion</b>, thereby dictating the tumultuous course of the baron's extravagant life.",
        "txt2": [
            "Progression of a Game and Unique Features :",
            "Emotions engage in fierce competition for <b>control</b> of the various <b>cerebral regions</b> of the baron by placing pieces each turn according to a specific order. This approach has various <b>repercussions</b> on other players and on the baron himself, due to the <b>power</b> associated with each conquered area. At the end of each turn, an <b>event card</b> is revealed by the designated player, and its impact on the game is determined by the leading emotion, adding to the absurd and comical adventures of noble life. The game concludes when the <b>baron's life expires</b>, and the final turn ends."
        ],
        "txt3": [
            "Production and Involvement :",
            "My key role in creating this game was to <b>design the rules system</b> and work on the <b>design</b> and <b>illustrations</b> of the game board. This prototype was developed by a team of 4 people over a period of 8 weeks. One of our major challenges in designing the board was to <b>accurately represent the real anatomy</b> of the brain by placing the areas correctly and connecting them appropriately. It was also crucial to distribute points judiciously in different areas, awarding <b>more</b> points to challenging-to-control zones and <b>fewer</b> points to less strategic zones, such as those located in the corners of the board. Another key challenge during production was <b>balancing the powers</b> of different zones and event cards. Since the abilities of event cards are tied to the player's emotion revealing them, we had to ensure, after many playtesting sessions, that no emotion became too dominant compared to others."
        ],
        "txt4": [
            "Inspirations :",
            "Our main sources of inspiration for this game were the board games <b>Risk</b> and <b>El Grande</b> for their <b>territory control</b> mechanics, both of which are references in this field. Concerning the visual aspect, we drew inspiration from the quirky, dark, and twisted style of <b>Tim Burton</b>, as well as from the games Sleep Tight and Gloom for their unique atmosphere."
        ],
        "images1": [
            "https://i.ibb.co/vvq3SCs/Presentation3-D.png",
            "https://i.ibb.co/WH8WVMY/TopBoite.png",
            "https://i.ibb.co/1ZZMWrv/Sell-Sheets.png",
            "https://i.ibb.co/P47cdSK/Board.png",
            "https://i.ibb.co/L5Z6pqP/Planchettes-De-Jeu.png",
            "https://i.ibb.co/M7wyX31/Cartes-Perso.png",
            "https://i.ibb.co/jv3FddK/Cartes-Event.png",
            "https://i.ibb.co/HC1kNQz/AideJeu.png",
            "https://i.ibb.co/frgP9SD/Pions-Perso.png",
            "https://i.ibb.co/8PQh5RZ/PionsJeu.png",
            "https://i.ibb.co/ZLC3Bqp/Crest-Curse.png"
        ],
        "txtPhotos1": [
            "Complete content of the box: the game contains <strong>1 board</strong>, <strong>5 character cards</strong>, <strong>30 event cards</strong>, <strong>5 reference cards</strong>, <strong>127 tokens</strong>, and <strong>3 order boards</strong>.",
            "Illustration on the top of the box representing the <strong>5 emotions</strong> of the baron.",
            "Bottom of the box summarizing the <strong>basics of the game</strong> and the game's contents.",
            "The game board is divided into <strong>10 brain zones</strong>, each having a different power and point value. At the top of the board, players can find the <strong>turn counter</strong>.",
            "Different game boards (3, 4, 5 players) determine the <strong>turn order</strong>.",
            "The different <strong>character cards</strong> are distributed at the beginning of the game to each player.",
            "The <strong>event cards</strong> have a description at the top of the card and an effect for each emotion.",
            "The <strong>reference cards</strong> explain the various symbols found in the game.",
            "The <strong>tokens</strong> represent each emotion for turn order and scoring.",
            "<strong>Smaller game tokens</strong> represent emotions on the board's zones.",
            "<strong>Curse token</strong> and <strong>turn counter token</strong>."
        ],
        "images2": [
            "https://i.ibb.co/hVrwgY0/Contenu-Boite1.png",
            "https://i.ibb.co/x2S5dMJ/Contenu-Boite2.png",
            "https://i.ibb.co/Kzmf87Q/Boite.png",
            "https://i.ibb.co/V3ThWfW/Board-Photo.png",
            "https://i.ibb.co/5xY6gMX/Cartes-Perso-Photo.png",
            "https://i.ibb.co/pRcB767/Cartes-Events.png",
            "https://i.ibb.co/SxNVGSv/Aide-Jeu-Photo.png",
            "https://i.ibb.co/K2Dgcf8/Carton-Tours.png",
            "https://i.ibb.co/3ftS137/Pions.png"
        ],
        "txtPhotos2": [
            "Final version of the physical prototype of the game. The board is foldable and printed on a <strong>square</strong> panel, and the box is a <strong>recycled</strong> game box.",
            "Final version of the game accessories. The cards are printed in the size of <strong>tarot cards</strong>, the tokens are glued to <strong>cardboard</strong>, and we used pieces from the <strong>Rysk</strong> game for the game tokens.",
            "Physical version of the game box. We painted it in <strong>black</strong> and printed the images of the <strong>emotions</strong>.",
            "Physical version of the <strong>game board</strong>.",
            "Physical version of the <strong>character cards</strong>.",
            "Physical version of the <strong>event cards</strong>. Despite their fairly large size, we noticed that the <strong>text</strong> could be more readable.",
            "Physical version of the <strong>reference cards</strong>.",
            "Physical version of the <strong>game boards</strong> attached to pieces of <strong>cardboard</strong>.",
            "Physical version of the various <strong>game tokens</strong>."
        ],
        "cover": "https://i.ibb.co/0ZRcFzT/RM.png",
        "roles": [
            "Designer",
            "Illustrator"
        ],
        "technos": [
            "Photoshop"
        ],
        "canva": [
            "https://drive.google.com/file/d/1LOndUHi0UJ2lmWc_KCTaCrrw-GTVFoWw/preview"
        ],
        "collab": [
            "Roman Cros",
            "Justin Marques",
            "Julien Plamondon"
        ],
        "collabLiens": [
            "https://romancros.wixsite.com/portfolio-uqat",
            "https://justinmarques.myportfolio.com/",
            "https://jplam117.artstation.com/projects"
        ]
    },
    {
        "id": "RepairNDespair",
        "name": "Repair 'n' Despair",
        "type": "designJeu",
        "date": "2021",
        "descriptionProjet": "Repair'N Despair is a captivating <b>cooperative</b> tabletop game where each player embodies a dedicated member of the crew of the STS Prometheus, a spaceship under attack by a terrifying extraterrestrial creature</b>. The objective is clear: players must <b>work as a team</b> to <b>repair</b> the spacecraft and eliminate the extraterrestrial threat before it becomes unstoppable.",
        "txt2": [
            "Major Innovation!",
            "This game features a <b>unique feature</b>: the use of a <b>mobile application</b> is essential to play. This application not only <b>times</b> the allotted time for the crew members to complete their objectives but also adds a <b>dose of stress</b> by allowing the extraterrestrial creature to <b>move randomly</b>. At predefined intervals, an <b>alarm</b> sounds on the application, forcing players to interrupt their actions to move the creature following the instructions provided by the mobile app."
        ],
        "txt3": [
            "Commitment, Production, and Major Challenges:",
            "My primary role in this project was <b>designing</b> the game rules in collaboration with other team members. I also <b>programmed</b> the mobile application and contributed to <b>graphic design</b> and the creation of the physical prototype. This prototype was developed by a team of 4 people over a period of 8 weeks.Our biggest challenge was finding a way to make the <b>game faster and less repetitive</b> than our initial ideas, which turned out to be too long and monotonous for players. That's why we decided to introduce the <b>randomness</b> mechanic via the mobile application, ensuring unique gameplay every time. Additionally, to eliminate monotony, we incorporated a mechanic where a player becomes the <b>team leader</b> each turn and assigns actions to other players, maintaining a dynamic pace, especially if a traitor is part of the game."
        ],
        "txt4": [
            "Inspirations:",
            "Our main sources of inspiration for this game were hidden <b>identity games</b>, where each player must complete various tasks to survive, such as Among Us or Unfortunate Spacemen, as well as movies like Alien for the theme. Visually, we drew inspiration from space depictions of the 1940s-50s and the graphic style of pulp science fiction."
        ],
        "images1": [
            "https://i.ibb.co/WK9tkzp/boite-Front.jpg",
            "https://i.ibb.co/wCBShrw/boite-Back.jpg",
            "https://i.ibb.co/NL2GdrT/contenu.jpg",
            "https://i.ibb.co/fGMQjZ7/cartes.jpg",
            "https://i.ibb.co/wdNJY0V/pions.jpg",
            "https://i.ibb.co/Kr96BRL/de.jpg",
            "https://i.ibb.co/kBDkrcL/layout.jpg",
            "https://i.ibb.co/sgL9zs1/carte-Perso.png",
            "https://i.ibb.co/D433XGj/carte-Equipage.png",
            "https://i.ibb.co/tHtcR89/cover-back.png"
        ],
        "txtPhotos1": [
            "<strong>Game case</strong>, with a design heavily inspired by pulp science fiction style.",
            "On the back of the box, you will find a brief description of the game, all relevant information such as the number of players, the duration of a game, etc., as well as a QR code for downloading the application.",
            "Complete content of the box: the game includes <strong>16 room tiles</strong>, <strong>40 bridges</strong>, <strong>7 dice</strong>, <strong>5 pawns</strong>, <strong>9 cards</strong>, and <strong>50 break tokens</strong>.",
            "The game includes two types of roles: <strong>impostor</strong> and <strong>crew</strong>, which change the players' objectives. The <strong>character cards</strong> indicate the color of the pawn that each player represents and also serve as a reminder card.",
            "Each player is represented by <strong>a pawn</strong> of the color of their crew card, while the <strong>red tokens</strong> represent damage caused by the monster.",
            "The three types of dice each have a different purpose. The <strong>16-sided die</strong> represents areas, the <strong>8-sided die</strong> represents bridge colors, and the <strong>6-sided dice</strong> determine the various actions that players can take on their turn.",
            "The game offers different tile arrangements to provide a high level of <strong>replayability</strong>.",
            "<strong>Character cards</strong> also serve as a game guide and explain the various possible actions.",
            "<strong>Role cards</strong> are distributed at the beginning of the game, but no one knows in advance if a traitor is part of the crew.",
            "The <strong>top</strong> and <strong>bottom</strong> of the game box."
        ],
        "images2": [
            "https://i.ibb.co/YjxBQVB/exemple-Game2.jpg",
            "https://i.ibb.co/6tjFWTk/app.jpg",
            "https://i.ibb.co/8cfCVNK/app-Screen1.png",
            "https://i.ibb.co/DWgtmJF/app-Screen2.png"
        ],
        "txtPhotos2": [
            "Example of a typical game with the <strong>basic game layout</strong>.",
            "The <strong>application</strong> that allows you to play the game during a typical game.",
            "The <strong>main screen of the application</strong> allows you to start a game and provides information about it before starting.",
            "At the end of a game, players have the option to <strong>restart</strong> the game and receive a different end message depending on their success."
        ],
        "cover": "https://i.ibb.co/Tc0rzdd/repair-Ndespair.png",
        "roles": [
            "Designer",
            "Programmer"
        ],
        "technos": [
            "Unity",
            "Photoshop"
        ],
        "canva": [
            "https://drive.google.com/file/d/1srl9wsagx6Sn8OWyMaRtMf1Io8M4ul2L/preview"
        ],
        "collab": [
            "Roman Cros",
            "Justin Marques",
            "Julien Plamondon"
        ],
        "collabLiens": [
            "https://romancros.wixsite.com/portfolio-uqat",
            "https://justinmarques.myportfolio.com/",
            "https://jplam117.artstation.com/projects"
        ]
    },
    {
        "id": "JKM",
        "name": "John Kenn Mortensen",
        "type": "autre",
        "date": "2021",
        "descriptionProjet": "This creation represents my second <b>motion design project</b>. The goal of this project, with a dark and slightly frightening tone, was to explore the use of the <b>puppet tool</b> in After Effects to animate various objects and characters.",
        "txt2": [
            "Production :",
            "This animation was created solo over a period of <b>one month</b>, primarily using the <b>puppet tool</b> to animate all elements of the project. It was my first experience with this tool, which required a significant time investment to cut out each element of the illustrations while preserving the smallest details and ensuring natural movement of the different parts. Additionally, this project provided me with the opportunity to deepen my knowledge of <b>particle effects</b>, <b>fractal noise</b>, and <b>3D creation</b> within After Effects."
        ],
        "txt3": [
            "Inspiration :",
            "For a long time, I had the desire to create a work in this specific universe because I have always been fascinated by slightly <b>horrific</b> illustrations as well as <b>horror</b> and <b>surrealism</b> themes. That's why I chose to draw inspiration from the illustrations of <b>John Kenn Mortensen</b>, one of my favorite artists, in order to animate them with After Effects."
        ],
        "LienYT": "https://www.youtube.com/embed/00sdrKHIxJ4",
        "cover": "https://i.ibb.co/w4J4tDQ/johnkenn-Cover.png",
        "roles": [
            "Motion Designer"
        ],
        "technos": [
            "After Effects",
            "Photoshop"
        ]
    },
    {
        "id": "Tokyo",
        "name": "Tokyo",
        "type": "autre",
        "date": "2021",
        "descriptionProjet": "This small <b>motion design project</b> aimed to explore various tools and plugins in After Effects while incorporating luminous elements and shapes into the real world.",
        "txt2": [
            "Production :",
            "Completed in just <b>one month</b>, this project primarily relied on a plugin called <b>Thicc Stroke</b> to create bright white lines. It also allowed me to deepen my understanding of using <b>masks</b> in the software to seamlessly integrate elements into the scene."
        ],
        "txt3": [
            "Inspiratio :",
            "The inspiration for this project came to me from the opening sequence of the Japanese animation <b>Sarazanmai</b>. This sequence features two-dimensional characters moving within real images of Tokyo, with bright white lines and striking animations. I've always been captivated by this video because the music blends perfectly with the white light and the synchronization of animations, creating <b>a soothing atmosphere</b>. So, my desire was to create something similar."
        ],
        "LienYT": "https://www.youtube.com/embed/SMKQ7CC4Mh4",
        "cover": "https://i.ibb.co/0Mp4Q4j/tokyo-Cover.png",
        "roles": [
            "Motion Designer"
        ],
        "technos": [
            "After Effects"
        ]
    }
]