[
    {
        "id": "SS",
        "name": "Space Scoundrel",
        "type": "jeu",
        "date": "2022",
        "txt": [
            "Space Scoundrel est un jeu de tir à la troisième personne de style “Action Roguelike” dans lequel le joueur incarne un pirate de l’espace qui a comme but d’aborder un vaisseau et prendre tout son butin. Le joueur pourra donc explorer un vaisseau généré procéduralement dans lequel il retrouvera différents types d'ennemis et d’armes pour se défendre.",
            "Le but du joueur sera donc de tracer son chemin dans le vaisseau et survivre jusqu’à la salle des contrôles pour pouvoir prendre le contrôle du vaisseau et terminer le jeu. Si le joueur meurt, il devra recommencer du début dans un nouveau donjon généré procéduralement.",
            "Mes rôles principaux dans ce projet ont été d’être designer de systèmes et programmeur pour le système de génération du donjon, les armes, le personnage et les ennemis. J’ai donc créé un système de génération de donjon qui prend des prefabs de pièce et crée un chemin dans une grille selon la grandeur désirée. J’ai aussi créé un système d’armes qui ont toutes différentes statistiques différentes et amène donc une jouabilité variée pour le joueur selon l’arme qu’il décide d'utiliser. Le plus grand défi de ce projet fut vraiment le système d’ennemis, car je n’avais pas beaucoup d’expérience avec les state machines, j’ai donc dû faire beaucoup de recherche sur le sujet pour comprendre comment elles fonctionnent. Cette partie du projet fut celle qui me prit le plus de temps, mais je trouve que je suis arrivé à un bon résultat pour une première expérience.",
            "Je suis très fier du résultat de ce projet, il est devenu le projet avec le plus d’envergure que j’ai réalisé à ce jour.",
            "Ce projet fut développé en équipe de 2 personnes et sur une durée de 6 semaines."
        ],
        "LienBuild": "https://itch.io/embed-upload/7151988?color=7da2a9",
        "images1": [
            "https://i.ibb.co/D9GMyrs/SS-Spawn.png",
            "https://i.ibb.co/1bWwn5j/SS-Caf.png",
            "https://i.ibb.co/GHSb8VR/SS-Storage.png",
            "https://i.ibb.co/1ffRHb5/SS-Plants.png",
            "https://i.ibb.co/NKVFsF4/SS-Offices.png",
            "https://i.ibb.co/nmmwXjh/SS-Meeting-Room.png",
            "https://i.ibb.co/ZcN74tr/SS-Lab.png",
            "https://i.ibb.co/wds3jKN/SS-Generator.png",
            "https://i.ibb.co/P6FjRv0/SS-Fire-Fight2.png"
        ],
        "txtPhotos1": [
            "Salle de départ ou le joueur commence son abordage du vaisseau",
            "Cafétéria retrouvée dans le vaisseau",
            "Salle de rangement retrouvée dans le vaisseau",
            "Serre retrouvée dans le vaisseau",
            "Bureaux administratifs du vaisseau",
            "Salle de réunion du vaisseau",
            "Laboratoire du vaisseau",
            "Génératrice du vaisseau",
            "Exemple d'ennemis retrouvé dans le vaisseau"
        ],
        "images2": [
            "https://i.ibb.co/HVL09wr/Vaisseau-1.png",
            "https://i.ibb.co/5hPcZd0/Vaisseau-2.png",
            "https://i.ibb.co/WV0XJ3c/Vaisseau-3.png",
            "https://i.ibb.co/HxKFV5h/SS-Menu.png",
            "https://i.ibb.co/jbKQMBH/SS-Controls.png",
            "https://i.ibb.co/T2P9RJb/SS-Gun-Desc.png",
            "https://i.ibb.co/dkLY7dR/SS-Gun-Comp.png",
            "https://i.ibb.co/pZnZ7Yy/SS-Floating-UI.png",
            "https://i.ibb.co/J7HzNkZ/SS-Final-Room.png"
        ],
        "txtPhotos2": [
            "Exemple de carte de vaisseau",
            "Exemple de carte de vaisseau",
            "Exemple de carte de vaisseau",
            "Menu principal du jeu.",
            "Écran des contrôles du jeu",
            "UI description des armes",
            "UI comparaison de l'arme équipée et celle trouvée",
            "UI flottant de description d'une arme trouvée",
            "UI de fin du jeu"
        ],
        "cover": "https://i.ibb.co/9sFqxLr/space-Scoundrel-Cover.png",
        "roles": [
            "Designer de systèmes",
            "Programmeur"
        ],
        "technos": [
            "Unity",
            "C#"
        ]
    },
    {
        "id": "PH",
        "name": "Petit Héros",
        "type": "jeu",
        "date": "2021",
        "txt": [
            "Petit Héros est un jeu de style d’action aventure grandement inspiré de la série de jeux EarthBound pour le style graphique et le style d'aventure. Dans celui-ci le joueur incarne un enfant qui doit sauver le monde de la Dame en Noire, une entité démoniaque qui veut prendre le contrôle de la terre. Cet enfant a aussi le pouvoir de passer dans un monde fantastique pour réussir sa quête et tous les éléments du monde réel sont donc transformés.",
            "Ce projet fut développé en équipe de 6 personnes sur une durée d’environ 6 semaines. Mes responsabilités principales étaient de dessiner toutes les tuiles utilisées pour construire les niveaux, dessiner les ennemis et leurs animations et de dessiner divers éléments de décors. J’ai aussi occupé le rôle de level designer dans ce projet et mon but était donc de construire les différents niveaux pour qu’ils soient intéressants dans le monde normal, mais aussi dans le monde imaginaire.",
            "Ceci fut donc le plus grand défi pour moi lors de ce projet, car le monde imaginaire est beaucoup plus attrayant et intéressant à explorer. Le défi était donc de rendre le monde normal tout aussi attrayant en plaçant différentes interactions, NPC et objets dans le monde qui ont un différent résultat dépendamment du monde dans lequel nous nous trouvons."
        ],
        "LienYT": "https://www.youtube.com/embed/4GJr4MK-xMg",
        "images1": [
            "https://i.ibb.co/2tz59B4/Blocking-Monde-1-2.png",
            "https://i.ibb.co/Q8Bdjny/Blocking-Monde-1-1.png",
            "https://i.ibb.co/1qhqGPj/Blocking-Monde-2-1.png",
            "https://i.ibb.co/mThGYkb/Blocking-Monde-2-2.png",
            "https://i.ibb.co/9TTHCDK/Blocking-Monde-3-1.png",
            "https://i.ibb.co/GJhpSTv/Blocking-Monde-3-2.png"
        ],
        "txtPhotos1": [
            "Carte du niveau 1 (Monde Réel)",
            "Carte du niveau 1 (Monde Imaginaire)",
            "Carte du niveau 2 (Monde Réel)",
            "Carte du niveau 2 (Monde Imaginaire)",
            "Carte du niveau 3 (Monde Réel)",
            "Carte du niveau 3 (Monde Imaginaire)"
        ],
        "images2": [
            "https://i.ibb.co/kgrsFFY/Main-tuiles.png",
            "https://i.ibb.co/0DFMRNN/Golf-Tuiles.png",
            "https://i.ibb.co/znsL8nC/Fences-Tuiles.png",
            "https://i.ibb.co/ZTzxLwS/Maint-Tuiles-2.png",
            "https://i.ibb.co/1vmC5cy/Pont-Tuiles.png",
            "https://i.ibb.co/P9nMSGb/Maisons.png",
            "https://i.ibb.co/sbSTP9P/Decor-1.png",
            "https://i.ibb.co/8BpNz0F/Voiture.png",
            "https://i.ibb.co/5kK15rJ/Tables.png",
            "https://i.ibb.co/Tmq3LHD/Puit.png",
            "https://i.ibb.co/M73TkqB/Cart.png",
            "https://i.ibb.co/G03z8Y6/Arbres.png",
            "https://i.ibb.co/sWV7CPf/Arbres-Img.png",
            "https://i.ibb.co/6HwL0Rp/Decor-2.png",
            "https://i.ibb.co/wRVXrXH/Ennemis.png",
            "https://i.ibb.co/Xpmb9qM/Animaux.png",
            "https://i.ibb.co/X4D2xCq/NPC.png"
        ],
        "txtPhotos2": [
            "Tuiles du niveau 1 & 2",
            "Tuiles du niveau 3",
            "Tuiles de clotures",
            "Tuiles de pavé",
            "Tuiles de pont",
            "Maisons du monde réel",
            "Élément de décor divers",
            "Voiture et chariot du niveau 1",
            "Éléments de décor du niveau 2",
            "Puits et fontaine du niveau 2",
            "Voiturette de golf et caravane du niveau 3",
            "Arbres du monde réel",
            "Arbres du monde imaginaire",
            "Plantes décoratives",
            "Ennemis du jeu",
            "Animaux divers",
            "NPC divers"
        ],
        "cover": "https://i.ibb.co/GVrTR96/petit-Heros.png",
        "roles": [
            "Level designer",
            "Illustrateur"
        ],
        "technos": [
            "Aseprite",
            "Unity"
        ]
    },
    {
        "id": "LASTSPARK",
        "name": "Last Spark",
        "type": "jeu",
        "date": "2020",
        "txt": [
            "Last Spark est un jeu d'action / aventure et de survie où règne une constante présence sinistre. Le joueur incarne la dernière lueur d’espoir du monde et doit réussir à survivre assez longtemps pour pouvoir vaincre les seigneurs de la noirceur et leurs sbires qui rôdent librement dans l’environnement. Le joueur devra explorer le monde pour y trouver de nouvelles armes et des sorts pour l’aider dans sa quête.",
            "Ce projet a été pensé et développé en équipe de 3 personnes sur l’étendue d’environ 4 mois. Mes responsabilités principales étaient d’être designer de système et programmeur, plus précisément sur le système de jour et de nuit et celui d’inventaire et de crafting. Mes tâches consistaient donc à balancer et gérer les vagues d’ennemi qui arrivaient seulement la nuit en m'assurant que le joueur ne meurt pas automatiquement.La plus grande partie de mon travail était de programmer et gérer toute la partie de l’inventaire et du système de crafting en passant par tous les items que le joueur peut ramasser et utiliser.",
            "Le plus gros défi dans ce projet était donc de bien balancer le dégât de chaque arme pour qu’elles ne soient pas inutilisables ni trop fortes, de trouver les bonnes combinaisons pour les recettes de craft pour qu’elles ne soient pas impossibles à faire et à gérer le drop rate et la rareté des ingrédients.",
            "Le projet final fut très bien reçu par nos professeurs et par les autres élèves et est encore montré comme exemple lors du cours aux étudiants actuels. Je suis extrêmement fier de ce projet, car il est le premier projet de grande envergure que j’ai réalisé et c’est un concept qui tournait dans nos têtes depuis le début de nos études, donc pouvoir le réaliser fut vraiment important pour moi."
        ],
        "LienProjet": "https://lastspark.netlify.app/",
        "LienYT": "https://www.youtube.com/embed/5FMPfM0h2wI",
        "LienBuild": "https://itch.io/embed-upload/7163183?color=7da2a9",
        "canva": [
            "https://drive.google.com/file/d/1oq-eduBk8chdUY3K3PrFkLPofq6eKeCx/preview",
            "https://drive.google.com/file/d/1ahRtIMVLA-P4gkrcs1im5HEyR3BY8XC8/preview"
        ],
        "GH": "https://github.com/MathieuGaudreau/LastSpark",
        "images1": [
            "https://i.ibb.co/VSc3k7Z/accueil.webp",
            "https://i.ibb.co/FsMPfVT/menu.webp",
            "https://i.ibb.co/6txcX3p/pause.webp",
            "https://i.ibb.co/353y9MF/inventaire.webp",
            "https://i.ibb.co/K7BZ9Ff/aide.webp"
        ],
        "txtPhotos1": [
            "Affiche du jeu",
            "Écran principal du jeu, ici le joueur peut commencer à jouer, voir les instructions et quitter le jeu.",
            "Le menu permet de quitter vers le menu principal ou de quitter le jeu.",
            "Le sytème d'inventaire permet d'équipper les armes et pouvoirs et d'organiser les objets obtenus durant le jeu.",
            "Des écrans d'aides vont apparaitre lors du jeu pour expliquer au joueur les différentes méchaniques."
        ],
        "txtPhotos2": [
            "Exemple de disposition de la carte",
            "Le feu de camp sert de safezone pour le joueur et il peut interagir avec le feu pour se soigner et crafter.",
            "Le joueur peut retrouver des ruines dans le jeu qui donne accès à des améliorations, des armes et un sort.",
            "Exemple de combat contre un boss. Les boss et les ennemies ont plus en plus de vies au fil que le jeu avance."
        ],
        "images2": [
            "https://i.ibb.co/D1HMDV5/Exemple-Map-Last-Spark.png",
            "https://i.ibb.co/yPykPpD/debut.webp",
            "https://i.ibb.co/qntnzG9/ruine.webp",
            "https://i.ibb.co/7nZ1vS5/boss.webp"
        ],
        "cover": "https://i.ibb.co/yP4mz3P/lastspark-Cover.png",
        "roles": [
            "Designer de systèmes",
            "Chargé de projet",
            "Concepteur Sonore",
            "Programmeur",
            "Intégrateur"
        ],
        "technos": [
            "Unity",
            "C#",
            "Photoshop"
        ]
    },
    {
        "id": "nightwell",
        "name": "Escape the Nightwell Keep",
        "type": "jeu",
        "date": "2021",
        "txt": [
            "Ce projet est un petit jeu de plateforme dans lequel le joueur doit explorer l’environnement pour réussir à s'échapper du château en évitant les multiples pièges et ennemis qui errent à l’intérieur.",
            "Ce jeu est inspiré du style dark fantasy et de jeux comme Dead Cells et Blasphemous.",
            "J’ai réalisé ce jeu seul sur une durée d’environ 3 semaines."
        ],
        "LienProjet": "https://mathieugaudreau.itch.io/escape-the-nightwell-keep",
        "LienBuild": "https://itch.io/embed-upload/4703468?color=7da2a9",
        "images1": [
            "https://i.ibb.co/GFqmzRw/Blocking-Donjon.png",
            "https://i.ibb.co/BwnvGPm/Start.png",
            "https://i.ibb.co/DDHfrKk/Area1.png",
            "https://i.ibb.co/pZwCVGn/Area2.png",
            "https://i.ibb.co/7nRFt18/Area3.png",
            "https://i.ibb.co/VBSwrqT/Area4.png",
            "https://i.ibb.co/5rZbnBq/Secret-Area.png"
        ],
        "txtPhotos1": [
            "Carte du donjon",
            "Emplacement de départ du joueur",
            "Espace du niveau 1",
            "Espace du niveau 2",
            "Espace du niveau 3",
            "Espace du niveau 4",
            "Exemple d'espace secret"
        ],
        "images2": [
            "https://i.ibb.co/cyxCzCy/Menu.png",
            "https://i.ibb.co/Ky6gN09/Instructions.png",
            "https://i.ibb.co/cw2f2wk/Death-Screen.png",
            "https://i.ibb.co/PmZM0Tw/End-Screen.png"
        ],
        "txtPhotos2": [
            "Menu principal du jeu.",
            "Écran d'instruction du jeu.",
            "Écran de mort, le joueur peut quitter ou recommencer le jeu du dernier checkpoint.",
            "Écran de fin du jeu, elle indique le nombre de point ramassé par le joueur et lui permet de rejouer ou quitter le jeu."
        ],
        "cover": "https://i.ibb.co/ypck3S5/nightwell.png",
        "roles": [
            "Level designer",
            "Designer de systèmes",
            "Programmeur",
            "Intégrateur",
            "Concepteur Sonore"
        ],
        "technos": [
            "Unity",
            "C#"
        ]
    },
    {
        "id": "RM",
        "name": "Règne de Malheurs",
        "type": "jeuTable",
        "date": "2021",
        "txt": [
            "Règne de malheurs est un jeu de contrôle de territoires dans lequel les joueurs incarnent chacun une émotion d’un baron de l’époque médiévale. Le but des joueurs sera donc d’être l’émotion dominante et ainsi dicter la vie du baron.",
            "Les émotions devront se battre pour contrôler les différentes zones cérébrales du baron, ce qui aura donc différents effets sur les autres joueurs et le baron lui-même. À chaque fin de tour, une carte évènement sera dévoilée et ajoute aux péripéties de la vie du noble, en plus d’avoir certains effets sur la partie elle-même.",
            "Mon rôle dans la création de ce jeu était d’être designer du système de règles et principalement le designer pour le plateau de jeu. Le plus grand défi en créant le plateau était de respecter l’anatomie d’un vrai cerveau avec les zones au bon endroit, tout en découpant les zones correctement pour qu’elles soient bien reliées entre elles. Ensuite, il fallait être capable de bien diviser et répartir les points dans les différentes zones, plus de points pour les zones difficiles à contrôler et moins pour celle dans les coins par exemple. Tout le plateau fut aussi dessiné à la main par moi-même.",
            "Ce projet fut développé en équipe de 4 personnes sur une durée d’environ 8 semaines."
        ],
        "images1": [
            "https://i.ibb.co/vvq3SCs/Presentation3-D.png",
            "https://i.ibb.co/WH8WVMY/TopBoite.png",
            "https://i.ibb.co/1ZZMWrv/Sell-Sheets.png",
            "https://i.ibb.co/P47cdSK/Board.png",
            "https://i.ibb.co/L5Z6pqP/Planchettes-De-Jeu.png",
            "https://i.ibb.co/M7wyX31/Cartes-Perso.png",
            "https://i.ibb.co/jv3FddK/Cartes-Event.png",
            "https://i.ibb.co/HC1kNQz/AideJeu.png",
            "https://i.ibb.co/frgP9SD/Pions-Perso.png",
            "https://i.ibb.co/8PQh5RZ/PionsJeu.png",
            "https://i.ibb.co/ZLC3Bqp/Crest-Curse.png"
        ],
        "txtPhotos1": [
            "Contenu du jeu",
            "Dessus de la boite",
            "Dessous de la boite",
            "Plateau de jeu",
            "Planchettes de jeu (3 , 4 , 5 joueurs)",
            "Cartes personnage",
            "Exemples de cartes événements",
            "Aide de jeu",
            "Pions personnages",
            "Pions de jeu",
            "Pion malédiction et pion compteur de tours"
        ],
        "images2": [
            "https://i.ibb.co/hVrwgY0/Contenu-Boite1.png",
            "https://i.ibb.co/x2S5dMJ/Contenu-Boite2.png",
            "https://i.ibb.co/Kzmf87Q/Boite.png",
            "https://i.ibb.co/V3ThWfW/Board-Photo.png",
            "https://i.ibb.co/5xY6gMX/Cartes-Perso-Photo.png",
            "https://i.ibb.co/pRcB767/Cartes-Events.png",
            "https://i.ibb.co/SxNVGSv/Aide-Jeu-Photo.png",
            "https://i.ibb.co/K2Dgcf8/Carton-Tours.png",
            "https://i.ibb.co/3ftS137/Pions.png"
        ],
        "txtPhotos2": [
            "Contenu complet de la boite",
            "Accessoires du jeu",
            "Boite du jeu",
            "Plateau de jeu",
            "Cartes des personnages",
            "Cartes événements du jeu",
            "Carte Aide de jeu",
            "Planchettes de jeu",
            "Pions de jeu"
        ],
        "cover": "https://i.ibb.co/0ZRcFzT/RM.png",
        "roles": [
            "Designer de systèmes",
            "Illustrateur"
        ],
        "technos": [
            "Photoshop"
        ],
        "canva": [
            "https://drive.google.com/file/d/1LOndUHi0UJ2lmWc_KCTaCrrw-GTVFoWw/preview"
        ]
    },
    {
        "id": "repairndespair",
        "name": "Repair 'n' Despair",
        "type": "jeuTable",
        "date": "2021",
        "txt": [
            "Repair’ N Despair est un jeu de table coopératif dans lequel les joueurs incarnent chacun un membre de l’équipage du STS Prometheus, un vaisseau qui est sous l’attaque d’une créature extraterrestre. Les joueurs doivent donc travailler en équipe pour réparer le vaisseau et se débarrasser du monstre.",
            "Le jeu à la particularité d’avoir besoin d’une application mobile pour y jouer. En effet, l’application donnera le temps que les joueurs ont pour compléter leur objectif, mais ajoutera aussi du stress chez les joueurs, car elle permet un déplacement aléatoire de la créature.",
            "Mon rôle principal était de créer les règles du jeu, ainsi que programmer l’application mobile. Le plus grand défi était de trouver un moyen de rendre la jouabilité plus rapide et moins redondante que nos idées initiales, donc c’est pour cela que nous avons décidé d’implémenter une application pour ajouter de la variété et du hasard. ",
            "Le projet fut réalisé en équipe de 4 personnes sur une durée de 8 semaines."
        ],
        "images1": [
            "https://i.ibb.co/WK9tkzp/boite-Front.jpg",
            "https://i.ibb.co/wCBShrw/boite-Back.jpg",
            "https://i.ibb.co/NL2GdrT/contenu.jpg",
            "https://i.ibb.co/fGMQjZ7/cartes.jpg",
            "https://i.ibb.co/wdNJY0V/pions.jpg",
            "https://i.ibb.co/Kr96BRL/de.jpg",
            "https://i.ibb.co/kBDkrcL/layout.jpg",
            "https://i.ibb.co/sgL9zs1/carte-Perso.png",
            "https://i.ibb.co/D433XGj/carte-Equipage.png",
            "https://i.ibb.co/tHtcR89/cover-back.png"
        ],
        "txtPhotos1": [
            "Dessus du boitier du jeu",
            "Derrière du boitier du jeu",
            "Contenu complet de la boite",
            "Cartes et tuiles du jeu",
            "Pions du jeu",
            "Dés du jeu",
            "Exemple de placement des tuiles",
            "Cartes personnages du jeu",
            "Carte d'équipage du jeu",
            "Dessus et dessous de la boite de jeu"
        ],
        "images2": [
            "https://i.ibb.co/YjxBQVB/exemple-Game2.jpg",
            "https://i.ibb.co/GH3tsqZ/exemple-Game.jpg",
            "https://i.ibb.co/6tjFWTk/app.jpg",
            "https://i.ibb.co/8cfCVNK/app-Screen1.png",
            "https://i.ibb.co/DWgtmJF/app-Screen2.png"
        ],
        "txtPhotos2": [
            "Exemple de partie",
            "Exemple de partie",
            "Application qui permet de jouer au jeu",
            "Écran menu, instructions, zone et du compteur",
            "Écran de fins du jeu"
        ],
        "cover": "https://i.ibb.co/Tc0rzdd/repair-Ndespair.png",
        "roles": [
            "Designer",
            "Programmeur"
        ],
        "technos": [
            "Unity",
            "Photoshop"
        ],
        "canva": [
            "https://drive.google.com/file/d/1srl9wsagx6Sn8OWyMaRtMf1Io8M4ul2L/preview"
        ]
    },
    {
        "id": "JKM",
        "name": "John Kenn Mortensen",
        "type": "creation",
        "date": "2021",
        "txt": [
            "Animation réalisée dans le cadre d'un travail pratique à thème libre. Le but de ce travail était d'expérimenter avec les effets de marionnettes, de bruits fractals, de particules et de 3D.",
            "L'animation a été créée avec les dessins de l'artiste danois John Kenn Mortensen."
        ],
        "LienYT": "https://www.youtube.com/embed/00sdrKHIxJ4",
        "cover": "https://i.ibb.co/w4J4tDQ/johnkenn-Cover.png",
        "roles": [
            "Motion Designer"
        ],
        "technos": [
            "After Effects",
            "Photoshop"
        ]
    },
    {
        "id": "TOKYO",
        "name": "Tokyo",
        "type": "creation",
        "date": "2021",
        "txt": [
            "Animation réalisée dans le cadre d'un travail pratique à thème libre. Le but de ce travail était d'expérimenter avec les masques et les différents effets.",
            "Ici beaucoup d'effets de glow, de camera tracking, de lumière et d'un plugin qui se nomme Thicc Stroke."
        ],
        "LienYT": "https://www.youtube.com/embed/SMKQ7CC4Mh4",
        "cover": "https://i.ibb.co/0Mp4Q4j/tokyo-Cover.png",
        "roles": [
            "Motion Designer"
        ],
        "technos": [
            "After Effects"
        ]
    }
]